#include <iostream>
#include <string.h>
#include <stdlib.h>

using namespace std;

///Задача: Прочита дума от конзолата, след това прочита число N, записва прочетената дума N на брой пъти в С-стринг и
///принтира на стандартния изход (конзолата) масива

///Нека N има ограничение да не е по голямо от 10;

const int WORD_SIZE = 31; ///предполагаме че думата, която прочитаме не е по дълга от 30 символа

const int MAX_N = 10;

int main(){
    char word[WORD_SIZE];

    cin.getline(word, WORD_SIZE); ///предпочитаме да четем с getline пред оператора <<
                                  ///,тъй като с getline можем да ограничим размера на входа

    int N;

    ///cin >> N; ///тук може просто да прочетем числото по този начин но в случая ще използваме функцията atoi самоцелно

    char number[3]; ///размерът му е 3 тъй като числото може да е най-много 10 ( записва се с 2 символа ) и не трябва да забравяме
                    ///мястото за терминиращия символ

    cin.getline(number, 3);

    N = atoi(number); ///от прочетеното извличаме само цифрите, с които започва

    int wordLength = strlen(word); ///намираме точния размер на прочетената дума

    char wordCopy[WORD_SIZE * MAX_N]; ///правим масив, в който ще запишем думата N пъти
                                      ///използваме константни стойности за размера на масива, тъй като стандарта на С++ го изисква

    strcpy(wordCopy,""); ///записваме празна дума

    for(int i = 0; i < N; i++){
        strcat(wordCopy, word);  ///N пъти долепяме прочетената дума
    }

    cout << wordCopy << endl;


    return 0;
}
